In [ ]:
import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# reading data

In [ ]:
info = dict(
    names=["Suraj","Shiv","Shivi","Anjali","Sunny"],
    age=[19,5,21,20,22],
    height=[5.23,3.5,5.1,5.9,6.1]
)
d1 = pd.DataFrame(info)

In [ ]:
print(d1)

In [ ]:
d1

In [ ]:
d2 = pd.read_csv("datasample.csv")

In [ ]:
d2

In [ ]:
pd.set_option("display.max_columns",None)

In [ ]:
df = pd.read_excel("Canada.xlsx",
              sheet_name=1,
              skiprows=20,
              skipfooter=2)

df

## looking the data
- head(n) - top n rows of the data
- tail(n) - bottom n rows of the data
- sample(n) - randomly return n rows
- info() - column wise data
- describe() - summary statistics of the data

In [ ]:
df.head(2)

In [ ]:
df.tail()

In [ ]:
df.sample(5)

In [ ]:
df.describe(include="object")

In [ ]:
df.info()

In [ ]:
df.columns

In [ ]:
df[["OdName",2003,2005,2009]]

In [ ]:
df.loc[1]

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[:10,[0,1,2,3,4]]

In [ ]:
df.loc[:10,[2000,2011,2013]]

## manipulating data

In [43]:
d2["total"] = d2["english"] + d2["math"] + d2["science"]

In [44]:
d2

    name  english  math  science  total
0  arjun       45    67       89    201
1  jyoti       67    89       78    234
2    sai       89    90       90    269
3    sri       90    78       67    235

In [47]:
d2.loc[0]

name       arjun
english       45
math          67
science       89
total        201
Name: 0, dtype: object

In [52]:
d2["average"] = d2["total"]/len(d2.select_dtypes(np.number))

In [53]:
d2

    name  english  math  science  total  average
0  arjun       45    67       89    201    50.25
1  jyoti       67    89       78    234    58.50
2    sai       89    90       90    269    67.25
3    sri       90    78       67    235    58.75